{
  "commands":[
    {
      "name":"/advanceseason",
      "description":"Advances the season by 1 and sets teams' season records to 0."
    },
    {
      "name":"/botstats",
      "description":"Shows some fun statistics about the bot, including the number of unique users, leagues, and uptime."
    },
    {
      "name":"/challenge <challenging-team> <offending-team> <rule-violated> <ruling>",
      "description":"Posts a ruling by a referee regarding a challenge that a team makes against another team."
    },
    {
      "name":"/channel <channel-mention> <purpose>",
      "description":"Links the channel you mentioned for a specific purpose, like for transactions or demands."
    },
    {
      "name":"/defensestats <tackles> <ints> <touchdowns> <sacks> <safeties> <fumble-recoveries>",
      "description":"Logs your defensive stats, as shown on the FF2 'Defense' server stats."
    },
    {
      "name":"/demand",
      "description":"Allows you to demand from your team as long as you are under the demand limit for the league."
    },
    {
      "name":"/demote <user>",
      "description":"Allows you to demote a player from their role. To demote franchise owners, you must be an admin. Otherwise, you must be a franchise owner."
    },
    {
      "name":"/fo <user> <team>",
      "description":"Allows admins to promote an individual to be the franchise owner of a team, if the position is vacant."
    },
    {
      "name":"/gametime <team1> <team2> <time>",
      "description":"Posts the gametime between one team and another team. Gametimes may be posted by franchise owners or general managers."
    },
    {
      "name":"/help",
      "description":"Displays helpful information about Anarchy commands."
    },
    {
      "name":"/kstats <attempts> <good-attempts>",
      "description":"Logs your kicker stats, as shown on the FF2 'Kicker' server stats."
    },
    {
      "name":"/lfp <message>",
      "description":"Posts a 'looking for players' message if the proper channel is set."
    },
    {
      "name":"/logo <team> <link>",
      "description":"Changes the logo of a team to the specified link. Valid links must direct to an image."
    },
    {
      "name":"/maxplayers <number>",
      "description":"Sets the player cap for all teams in the league to the specified number. May only be ran by admins."
    },
    {
      "name":"/newteam <full-name> <abbreviation> <logo>",
      "description":"Creates a new team and its associated role. May only be ran by admins. The logo must be a valid link directing to an image."
    },
    {
      "name":"/offer <player>",
      "description":"Allows a franchise owner or general manager to send a signing offer to a player, who can choose to accept or decline."
    },
    {
      "name":"/presence <type> <value>",
      "description":"Allows the bot owner (Donovan#3771) to change the bot's status."
    },
    {
      "name":"/promote <player> <role>",
      "description":"Allows a franchise owner to promote a specific player to either head coach or general manager."
    },
    {
      "name":"/qbstats <completions> <attempts> <touchdowns> <ints> <yards>",
      "description":"Logs your quarterback stats, as shown on the FF2 'Passing' server stats."
    },
    {
      "name":"/rbstats <attempts> <touchdowns> <yards>",
      "description":"Logs your runningback stats, as shown on the FF2 'Rushing' server stats."
    },
    {
      "name":"/refreshcommands",
      "description":"Refreshes all bot commands without having to do a complete shutdown of Anarchy. Only usable by Donovan."
    },
    {
      "name":"/release <user>",
      "description":"Releases a user from their team."
    },
    {
      "name":"/releaseall <team>",
      "description":"Releases all players from a team, as well as their franchise owner. This is pretty much 'disbanding'. Only usable by admins."
    },
    {
      "name":"/removeteam <team>",
      "description":"Removes the team from the bot's database and deletes the team role."
    },
    {
      "name":"/results <team1> <team2> <team1-score> <team2-score>",
      "description":"Logs the game's score and posts it into the proper channel. May be run by admins or managers."
    },
    {
      "name":"/revertresults <game-id>",
      "description":"Reverts the results of a game in the event that it was improperly logged. May be run by admins or managers."
    },
    {
      "name":"/ring <team>",
      "description":"Gives all members of the specified team a ring, and keeps track of how many rings the team itself has run. May only be run by admins."
    },
    {
      "name":"/roster <team>",
      "description":"Allows you to view the roster of a team."
    },
    {
      "name":"/setdemands <number>",
      "description":"Sets the max demands each person is allowed to have. Only admins may run this command."
    },
    {
      "name":"/setup",
      "description":"Runs you through the setup prompt for Anarchy. May only be run by admins."
    },
    {
      "name":"/standings",
      "description":"Allows you to view team standings for that season. **This command should be used in conjunction with /results, as /results keeps track of scores for one game.**"
    },
    {
      "name":"/teams",
      "description":"Allows you to view all teams and their franchise owners. Similar to 'focheck' for other bots."
    },
    {
      "name":"/trade <player1> <player2>",
      "description":"Allows trade one player for another player. May only be run by franchise owners and general managers."
    },
    {
      "name":"/whitelist <user> <role>",
      "description":"Allows you to whitelist a user as a manager or an admin, for use in other commands. May only be run by a server owner."
    },
    {
      "name":"/wrstats <attempts> <touchdowns> <yards>",
      "description":"Logs your wide receiver stats, as shown on the FF2 'Receiving' server stats."
    }
  ]
}